Repository: oheil/doTimeTable
Catalog: GUI/doTimeTable/WinFormStrings.*.resx
Languages: de_de

# String1
source: Timetable
de_de: Stundenplan

# String10
source: Project name
de_de: Projektname

# String100
source: The sum of all teachers hours per week (={0}) is less the sum of all needed hours in classes (={1})
de_de: Die Summer aller verfügbaren Lehrerstunden pro Woche (={0}) ist kleiner als die Summe der benötigten Stunden in allen Klassen (={1})

# String101
source: The maximum number of hours in subject {0} (={1}) is larger than the total maximum number of hours (={2})
de_de: Die maximale Anzahl an Stunden in Fach {0} (={1}) is größer als die Anzahl an Gesamtstunden (={2})

# String102
source: Teacher-to-Class
de_de: Lehrer-zu-Klasse

# String103
source: Edit Teacher to Class assignment
de_de: Editiere Lehrer zu Klassen Verknüpfung

# String104
source: <h3>Edit preset assignment of teachers and subject to classes</h3>
de_de: <h3>Eingabe von vordefinierter Festlegung von Lehrer und Fach zu Klasse</h3>

# String105
source: <p>Here you can edit predefined assignments of teachers and their subjects to classes.</p>
de_de: <p>Hier können Lehrer und ihre Fächer zu bestimmten Klassen fest zugeordnet werden.</p>

# String106
source: <br />Empty or the teacher who will teach this class in this subject
de_de: <br />Leer oder der Lehrer, der diese Klasse in diesem Fach unterrichten soll

# String107
source: <br />Non editable fields or columns with gray background are teacher or subjects which are part of the saved data but not in the current teacher or subject list. These columns are not checked and not saved.
de_de: <br />Felder oder Spalten, die grau hinterlegt und nicht editierbar sind, enthalten Fächer oder Lehrer, die in den gespeicherten Daten enthalten sind aber nicht in der Liste der Lehrer oder Fächer. Diese Spalten werden nicht geprüft und nicht gespeichert.

# String108
source: No classes, teachers or subjects are defined, nothing to do here.
de_de: Es sind keine Klassen, Lehrer oder Fächer definiert, hier ist noch nichts zu tun.

# String109
source: Not enough teacher hours (={0]) for subject {1}. Needed {2} hours.
de_de: Nicht genügend Lehrer Stunden (={0}) für Fach {1}. Es werden {2} Stunden gebraucht.

# String11
source: No Projects available. First create a new project by adding a new name into an empty row.
de_de: Keine Projekte vorhanden. Erstellen Sie zuerst ein neues Projekt in dem Sie einen Namen in eine leere Zeile eingeben.

# String110
source: The sum of needed hours (={0}) for subject {1} and teacher {2} is larger than the maximum hours (={3}) for this teacher.
de_de: Die Summer der benötigten Stunden (={0}) für Fach {1} und Lehrer {2} ist gößer als die maximale Anzahl der Stunden (={3}) für diesen Lehrer.

# String111
source: Class-to-Subject
de_de: Klasse-zu-Fach

# String112
source: Edit presets of classes and subjects to schedule
de_de: Editiere feste Zuordnungen von Klassen und Fächern zu Zeiten

# String113
source: <h3>Edit preset assignments of classes and subjects to each other and to schedule</h3>
de_de: <h3>Eingabe von vordefinierter Zuordnungen von Klassen und Fächern zueinander und zu bestimmten Zeiten</h3>

# String114
source: <p>Here you can edit predefined assignments of classes and subjects to each other, i.e. the connected classes should have the given subject at the same time, and you can set the scheduled time of this subject for these connected classes or a single class.</p>
de_de: <p>Hier können Klassen und Fächer miteinander verbunden werden, d.h. die verbundenen Klassen sollen das Fach zur gleichen Zeit haben, und man kann für diese verbundenen oder auch für einzelne Klassen Zeiten festlegen.</p>

# String115
source: <li><b>ConnectionID</b></li>
de_de: <li><b>VerknüpfungsID</b></li>

# String116
source: <br />An arbitrary but unique ID, which must be repeated for every connected class.
de_de: <br />Eine beliebige aber eindeutige ID, die für alle zu verknüpfenden Klassen wiederholt werden muss.

# String117
source: <br />The subject of the connected classes; must be equal for every single ConnectionID
de_de: <br />Das Fach der verbundenen Klassen; muss für jede VerknüpfungsID gleich sein.

# String118
source: <li><b>Day</b></li>
de_de: <li><b>Tag</b></li>

# String119
source: <br />The scheduled day for this connection; can be empty; must be equal for every single ConnectionID
de_de: <br />Der Tag an dem die Verknüpfung stattfindet; kann leer bleiben; muss für jede VerknüpfungsID gleich sein.

# String12
source: Delete
de_de: Löschen

# String120
source: <li><b>Hour</b></li>
de_de: <li><b>Stunde</b></li>

# String121
source: <br />The scheduled hour for this connection; can be empty; must be equal for every single ConnectionID
de_de: <br />Die Stunde an dem die Verknüpfung stattfindet; kann leer bleiben; muss für jede VerknüpfungsID gleich sein.

# String122
source: No classes or subjects are defined, nothing to do here.
de_de: Es sind keine Klassen oder Fächer definiert, hier ist noch nichts zu tun.

# String123
source: Example:
de_de: Beispiel:

# String124
source: Classes 1a and 1b will have Sports at the same time.
de_de: Die Klassen 1a und 1b haben zur gleichen Zeit Sport.

# String125
source: Classes 2a and 2b will have Sports at Monday to the third and fourth hour.
de_de: Die Klassen 2a und 2b haben beide Sport Montags zur 3. und 4. Stunde.

# String126
source: For each ConnectionID every class can only be called once.
de_de: Pro VerknüpfungsID kann jede Klasse nur einmal genannt werden.

# String127
source: For each ConnectionID only one subject can be given.
de_de: Pro VerknüpfungsID muß das Fach identisch sein.

# String128
source: For each ConnectionID only one timepoint can be given. Day and hour must both be empty or both not empty.
de_de: Pro VerknüpfungsID muß die Unterrichtsstunde identisch sein. Tag und Stunden müssen beide leer oder beide nicht leer sein.

# String129
source: Project
de_de: Projekt

# String13
source: New
de_de: Neu

# String130
source: Calculate timetable
de_de: Berechne Stundenplan

# String131
source: Click Yes to abort the current calculation!
de_de: Klicken Sie Ja um die laufende Berechnung abzubrechen!

# String132
source: Running Calculation
de_de: Laufende Berechnung

# String133
source: Data has not been saved, see log window
de_de: Die Daten wurden nicht gespeichert, siehe Log Fenster

# String134
source: General calculation state:
de_de: Allgemeiner Berechnungszustand:

# String135
source: Current progress value in %:
de_de: Laufende Berechnung in %:

# String136
source: Calculation progress
de_de: Fortschritt der Berechnung

# String137
source: Not enough teacher hours to fill all courses
de_de: Nicht genügend Lehrerstunden um alle Fächer auszufüllen

# String138
source: The number of teacher hours is low for subject
de_de: Die Anzahl der Lehrerstunden ist gering für Fach

# String139
source: The following issues may lead to very long calculation time:
de_de: Die folgenden Auffälligkeiten können zu sehr langer Rechenzeit führen:

# String14
source: My new project
de_de: Mein neues Projekt

# String140
source: Description
de_de: Beschreibung

# String141
source: Some kind of description
de_de: Eine Beschreibung des Projekts

# String142
source: Creation date
de_de: Erstellungsdatum

# String143
source: State
de_de: Status

# String144
source: View timetables
de_de: Öffne Stundenpläne

# String145
source: Copy
de_de: Kopie

# String146
source: Timetable
de_de: Stundenplan

# String147
source: Switch to teachers view
de_de: Zur Lehreransicht wechseln

# String148
source: Switch to classes view
de_de: Zur Klassenansicht wechseln

# String149
source: Export
de_de: Exportieren

# String15
source: A project needs a name
de_de: Ein Projekt braucht einen Namen

# String150
source: Export to default app
de_de: Exportieren zur Standardapp

# String151
source: No suitable timetable could be found!
de_de: Es konnte kein Stundenplan gefunden werden!

# String152
source: Configuration
de_de: Konfiguration

# String154
source: Value
de_de: Wert

# String155
source: <h3>Change parameters</h3>
de_de: <h3>Ändern von Parametern</h3>

# String156
source: The following parameter can be changed:
de_de: Folgende Parameter können geändert werden:

# String157
source: <br />If teachers are attached to one or more specific classes, it can easily happen that a teachter is assigned to two classes at the same time. This is normally not allowed and a valid timetable can not be found. To deactivate this constraint this value can be set to non zero.
de_de: <br />Wenn Lehrer einer oder mehreren Klassen fest zugeordnet werden, dann kann es leicht passieren, dass ein Lehrer zur gleichen Zeit zwei Klassen unterrichtet. Dies ist normalerweise ausgeschlossen und führt dazu, dass kein möglicher Stundenplan gefunden werden kann. Um diese Prüfung abzuschalten kann dieser Wert auf ungleich 0 gesetzt werden.

# String158
source: <br />The number of timetables to calculate. It is possible to calculate more than one timetable. Each timetable differs slightly. At least one timetable and maximal 10 will be calculated.
de_de: <br />Die Anzahl der zu berechnenden Stundenpläne. Es können mehr als ein Stundenplan berechnet werden. Die einzelnen Stundenpläne unterscheiden sich leicht. Es wird mindestens einer und höchstens 10 Stundenpläne berechnet.

# String159
source: No warnings.
de_de: Keine Warnungen.

# String16
source: Delete selected projects?
de_de: Selektierte Projekte löschen?

# String160
source: Random order
de_de: Zufällige Reihenfolge

# String161
source: Export anonymised
de_de: Exportiere anonymisiert

# String162
source: Failed to export project.
de_de: Projekt Export fehlgeschlagen.

# String163
source: Import of project failed.
de_de: Projektimport fehlgeschlagen.

# String165
source: <br />The minimum backtrace counts to reach, before a warning is printed. While the timetable is being filled deadends may be reached where no more allocations are possible. In this case a step back is performed, called backtrace, and another combination is tried. If a specific combination of class and subject triggers a large number of backtraces, it is a hint on an unresolvable constraint. Only values from 10^i for i=1,2,3,4,5,6,7 are used (10,100,1000,...).
de_de: <br />Die Mindestanzahl von Rückschritten bevor eine Warnung ausgegeben wird. Während der Stundenplan aufgefüllt wird, kann es zu Sackgassen kommen, in der keine weitere Zuordnung mehr möglich ist. In diesem Fall wird ein Rückschritt (backtrace) ausgeführt und eine andere Kombination ausprobiert. Wenn eine bestimmte Kombination von Klasse und Fach zu sehr vielen Rückschritten führt, dann kann das ein Hinweis auf eine unlösbare Einschränkung sein. Nur Werte aus 10^i für i = 1,2,3,4,5,6,7 werden verwendet (10,100,1000,...).

# String166
source: The following combination repeatedly results in unresolvable conflicts:
de_de: Die folgende Kombination führt wiederholt zu unlösbaren Konflikten:

# String167
source: <br />The timetable is calculated for classes in order of the classes list. To change this to a random order of classes set this parameter to a value larger than 0.
de_de: <br />Der Stundenplan wird für die Klassen in der Reihenfolge der Klassenliste berechnet. Wenn dieser Wert größer als 0 ist, wird die Klassenreihenfolge zufällig gewählt.

# String168
source: <br />Set this parameter to a value not 0 to allocate courses in the order of teacher coverage. The course with lowest coverage at first.
de_de: <br />Wenn dieser Wert ungleich 0 ist, dann werden die Fächer in der Reihenfolge der Abdeckung durch Lehrerstunden zugeordnet. Das Fach mit der geringsten Abdeckung zuerst.

# String169
source: About
de_de: Über

# String17
source: Edit/Create
de_de: Editiere/Erstelle

# String170
source: Support, Questions and Discussion
de_de: Unterstützung, Fragen und Diskussion

# String171
source: Acknowledgement
de_de: Danksagung

# String172
source: You are using a free and unrestricted copy of doTimeTable
de_de: Sie benutzen eine freie und unbeschränkte Kopie von doTimeTable

# String173
source: doTimeTable is distributed under the GNU General Public License (GPL)
de_de: doTimeTable unterliegt der GNU General Public License (GPL)

# String174
source: Please support the development of doTimeTable by purchasing a registration key
de_de: Bitte unterstützen Sie die Weiterentwicklung von doTimeTable durch Erwerb eines Registrierungsschlüssels

# String175
source: Julia script file can not be verified, aborting application.
de_de: Julia skript kann nicht verifiziert werden. Applikation wird beendet.

# String176
source: Julia script file can not be verified. If you didn't change the file this may be a security thread. Choose Cancel to exit the application now.
de_de: Julia skript kann nicht verifiziert werden. Wenn Sie die Datei nicht geändert haben könnte das ein Sicherheitsproblem darstellen. Wählen Sie Abbrechen um die Applikation zu beenden.

# String177
source: Security warning
de_de: Sicherheitswarnung

# String178
source: Registration ID
de_de: Registrierungs ID

# String179
source: Download new version
de_de: Download neue Version

# String18
source: Subjects
de_de: Fächer

# String180
source: Install new version
de_de: Installiere neue Version

# String181
source: No new version available
de_de: Keine neue Version verfügbar

# String182
source: New version available
de_de: Neue Version verfügbar

# String183
source: Julia dll file can not be verified, aborting application.
de_de: Julia dll kann nicht verifiziert werden. Applikation wird beendet.

# String184
source: Julia dll file can not be verified. If you didn't change the file this may be a security thread. Choose Cancel to exit the application now.
de_de: Julia dll kann nicht verifiziert werden. Wenn Sie die Datei nicht geändert haben könnte das ein Sicherheitsproblem darstellen. Wählen Sie Abbrechen um die Applikation zu beenden.

# String185
source: Copy log to clipboard?
de_de: Soll das Log in das Clipboard kopiert werden?

# String187
source: Download running
de_de: Download läuft

# String188
source: Current download in %:
de_de: Laufender Download in %:

# String189
source: Verifying downloads
de_de: Downloads verfizieren

# String19
source: Select a single project
de_de: Selektieren Sie ein einzelnes Projekt

# String190
source: Import registration key
de_de: Importiere Registrierungsschlüssel

# String191
source: The registration key is not valid
de_de: Der Registrierungsschlüssel ist ungültig

# String192
source: Import of registration key failed
de_de: Import des Registrierungsschlüssel ist fehlgeschlagen

# String193
source: Registration key is valid and installed
de_de: Der Registrierungsschlüssel ist gültig und wurde installiert

# String194
source: No major upgrades left for this registration
de_de: Für diese Registrierung sind keine Hauptversionsupgrades mehr verfügbar

# String195
source: Number of major upgrades left for this registration
de_de: Anzahl verbleibender Hauptversionsupgrades für diese Registrierung

# String2
source: File
de_de: Datei

# String20
source: Discard and close
de_de: Verwerfen und Schließen

# String21
source: Check
de_de: Überprüfen

# String22
source: Save and close
de_de: Speichern und Schließen

# String23
source: Edit subjects
de_de: Editiere Fächer

# String24
source: Subject name
de_de: Fach Name

# String25
source: Max Classes for Subject at once
de_de: Max gleichzeitige Klassen pro Fach

# String26
source: Max hours per day
de_de: Max Stunden pro Tag

# String27
source: Sports
de_de: Sport

# String28
source: English
de_de: Englisch

# String29
source: <h3>Subject Definition</h3>
de_de: <h3>Fächer Definition</h3>

# String3
source: Edit
de_de: Bearbeiten

# String30
source: <p>Here you define the subjects and their general time properties.</p>
de_de: <p>Hier werden die Fächer und ihre allgemeinen zeitlichen Eigenschaften definiert.</p>

# String31
source: <p>Description of the columns meaning:</p>
de_de: <p>Bedeutung der Spalten:</p>

# String33
source: <ul><li><b>Subject name</b></li>
de_de: <ul><li><b>Fach Name</b></li>

# String34
source: <li><b>Max Classes for Subject at once</b></li>
de_de: <li><b>Max gleichzeitige Klassen pro Fach</b></li>

# String35
source: <li><b>Max hours per day</b></li>
de_de: <li><b>Max Stunden pro Tag</b></li>

# String36
source: Fill in example data
de_de: Beispieldaten einfügen

# String37
source: Math
de_de: Mathe

# String38
source: <br />The name of the subject, e.g. math, sports, ...
de_de: <br />Der Name des Fachs, z.B. Mathe, Sport, ...

# String39
source: <br />Not more than N classes at the same time, e.g. for sports only 2 classes can use the sports hall together.
de_de: <br />Nicht mehr als N Klassen gleichzeitig, z.B. nur 2 Klassen können die Sporthalle zusammen benutzen.

# String4
source: New project...
de_de: Neues Projekt...

# String40
source: <br />Not more than N hours per day, e.g. math lessons should not be more than 2 hours a day for each class.
de_de: <br /> Nicht mehr als N Stunden pro Tag in jeder Klasse, z.B. Mathe soll nicht mehr als 2 Stunden pro Tag und Klasse unterrichtet werden

# String41
source: Are you sure to close the window? Changes will be lost.
de_de: Fenster wirklich schließen? Die Änderungen gehen verloren.

# String42
source: Data has been changed.
de_de: Die Daten wurden geändert.

# String43
source: Allowed values are
de_de: Folgende Werte sind erlaubt

# String44
source: Values must be
de_de: Die Werte müssen sein

# String45
source: Column
de_de: Spalte

# String46
source: Row
de_de: Zeile

# String47
source: Edit classes
de_de: Editiere Klassen

# String48
source: Classes
de_de: Klassen

# String49
source: <h3>Class definition and subjects hours per week</h3>
de_de: <h3>Klassen Definition und Anzahl Wochenstunden</h3>

# String5
source: Open project
de_de: Projekt öffnen

# String50
source: <p>Here you define the classes and how many hours of a subject they have per week.</p>
de_de: <p>Hier werden die Klassen und Stundenanzahl der Fächer pro Woche definiert.</p>

# String51
source: <ul><li><b>Class name</b></li>
de_de: <ul><li><b>Name der Klasse</b></li>

# String52
source: <br />The name of the class, e.g. 1a, 1b, 2a, ...
de_de: <br />Der Name der Klasse, z.B. 1a, 1b, 2a, ...

# String53
source: <li><b>The following columns are subject names</b></li>
de_de: <li><b>Die folgenden Spalten sind Fächernamen</b></li>

# String54
source: <br />The number of hours per week for each subject and class
de_de: <br />Die Anzahl an Wochenstunden pro Fach und Klasse

# String55
source: Class name
de_de: Name der Klasse

# String56
source: <br />Non editable columns with gray background are subjects which are part of the saved classes but not in the current subject list. These columns are not checked and not saved.
de_de: <br />Spalten, die grau hinterlegt und nicht editierbar sind, enthalten Fächer, die in den gespeicherten Daten enthalten sind aber nicht in der Liste der aktuellen Fächer. Diese Spalten werden nicht geprüft und nicht gespeichert.

# String57
source: The data in gray columns will not be saved! Should we proceed?
de_de: Die Daten in den grauen Spalten werden nicht gespeichert! Soll fortgefahren werden?

# String58
source: This table is read only because another table is open for editing.
de_de: Diese Tabelle kann nicht verändert werden, da eine andere Tabelle editiert wird.

# String59
source: Entries in this column must be positive integers or zero.
de_de: Einträge in dieser Spalte müssen positive Ganzzahlen oder Null sein.

# String6
source: Close
de_de: Schließen

# String60
source: Days and Hours
de_de: Tage und Stunden

# String61
source: Edit days and hours
de_de: Editiere Tage und Stunden

# String62
source: Days
de_de: Tage

# String63
source: Hours
de_de: Stunden

# String64
source: Monday
de_de: Montag

# String65
source: Tuesday
de_de: Dienstag

# String66
source: Wednesday
de_de: Mittwoch

# String67
source: Thursday
de_de: Donnerstag

# String68
source: Friday
de_de: Freitag

# String69
source: Saturday
de_de: Samstag

# String7
source: View
de_de: Ansicht

# String70
source: Sunday
de_de: Sonntag

# String71
source: Integer
de_de: Ganzzahlen

# String72
source: Empty
de_de: Leer

# String73
source: Zero
de_de: Null

# String74
source: Unique
de_de: Eindeutig

# String75
source: Positive
de_de: Positiv

# String76
source: Not zero
de_de: Nicht leer

# String77
source: <h3>Days and Hours Definition</h3>
de_de: <h3>Definition von Tage und Stunden</h3>

# String78
source: <p>Define the base structure of the timetable.</p>
de_de: <p>Hier wird die Grundstruktur des Stundenplans definiert.</p>

# String79
source: <ul><li><b>Days</b></li>
de_de: <ul><li><b>Tage</b></li>

# String80
source: <br />The days where the hours are allocated on
de_de: <br />Die Tage an denen die Stunden stattfinden

# String81
source: <li><b>Hours</b></li>
de_de: <li><b>Stunden</b></li>

# String82
source: <br />The hours, which take place on every day
de_de: <br />Die Stunden, die an den Tagen stattfinden

# String84
source: All days have the same numbers of hours.
de_de: Alle Tage haben die gleiche Stundenverteilung.

# String85
source: The data has not been checked successfully. Save anyways?
de_de: Die Daten wurden nicht erfolgreich überprüft. Soll trotzdem gespeichert werden?

# String86
source: Teacher
de_de: Lehrer

# String87
source: Edit teacher
de_de: Editiere Lehrer

# String88
source: Teachers name
de_de: Name des Lehrers

# String89
source: Max hours
de_de: Max Stunden

# String9
source: File {0} can not be opened
de_de: Datei {0} kann nicht geöffnet werden

# String90
source: <h3>Edit your teachers</h3>
de_de: <h3>Eingabe der verfügbaren Lehrer</h3>

# String91
source: <p>Here you edit all your teachers and how many hours per week they are teaching in total and for each subject.</p>
de_de: <p>Hier werden alle Lehrer mit ihrer maximalen Stundenzahl pro Woche und für jedes Fach eingegeben</p>

# String92
source: <ul><li><b>Teachers name</b></li>
de_de: <ul><li><b>Name des Lehrers</b></li>

# String93
source: <br />The name of teacher
de_de: <br />Der Name des Lehrers

# String94
source: <li><b>Max hours</b></li>
de_de: <li><b>Max Stunden</b></li>

# String95
source: <br />The maximum number of hours per week
de_de: <br />Die maximale Stundenzahl pro Woche

# String96
source: <br />The maximum number of hours per week for each subject. Zero or Empty if this teacher does not teach this subject.
de_de: <br />Die maximale Stundenzahl pro Woche und Fach. Null oder Leer, wenn der Lehrer dieses Fach nicht unterrichtet.

# String97
source: Class
de_de: Klasse

# String98
source: The sum of all subject hours (={0}) is larger than the available hours per week (={1})
de_de: Die Summe aller Stunden pro Fach (={0}) ist größer als die verfügbaren Stunden pro Woche (={1})

# String99
source: Copy
de_de: Kopieren
